Revit 2027 API
Profile.Curves Property
Retrieve the curves that make up the boundary of the profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveArray Curves { get; }
Public ReadOnly Property Curves As CurveArray
	Get
public:
property CurveArray^ Curves {
	CurveArray^ get ();
}
member Curves : CurveArray with get
Property Value
CurveArray
See Also
Reference
Profile Class
Autodesk.Revit.DB Namespace